app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC
---
  def index
    @tasks = Task.all.order(:id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @id = params[:id].to_i
    @task = Task.find_by(id: @id)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "count her rules"], ["description", "get over him"], ["created_at", "2018-09-21 20:12:28.985682"], ["updated_at", "2018-09-21 20:12:28.985682"]]
---
      task = Task.new(name: name,
                      description: description)
    end
    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
  def edit
    id = params[:id].to_i
    @task = Task.find_by(id: id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["name", "Don't pick up the phone"], ["description", "you know he's only calling cause he's drunk and alone"], ["updated_at", "2018-09-22 03:21:02.797664"], ["id", 2]]
---
    task = Task.find_by(id: id)
    new_name = params[:task][:name]
    new_decription = params[:task][:description]
# edge case: nil
    if task.update(name: new_name, description: new_decription)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 89]]
---
    task = Task.find_by(id: id)
    deleted_task = task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-21"], ["updated_at", "2018-09-22 02:07:56.652251"], ["id", 2]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2018-09-22 02:07:55.834475"], ["id", 2]]
---
    task = Task.find_by(id: id)
    if task.completion_date == nil
      task.update(completion_date: Date.today)
      redirect_to root_path, notice: "Congratulations! You completed \"#{task.name}\"!"
    else
      task.update(completion_date: nil)